<img src="https://www.faesa.br/hubfs/logo-faesa-branco.png" style="background-color:DarkBlue;width:250px;float:left;"/>
<br><br><br><br><br>
<table style="float:left;">
    <tr>
        <td>
            <p><strong>FAESA CENTRO UNIVERSITÁRIO</strong></p>
        </td>
        <td>
            <p></p>
        </td>
        <td>
            <p><strong>Valor:</strong>8,0 (oito) pontos</p>
        </td>
    </tr>
    <tr>
        <td>
            <p><strong>Unidade: </strong>Unidade de Computação e Sistemas</p>
        </td>
        <td>
            <p><strong>Curso: </strong>Ciência da Computação e Sistemas de Informação</p>
        </td>
        <td>
            <p></p>
        </td>
    </tr>
    <tr>
        <td>
            <p><strong>Disciplina: </strong>Análise de Dados Aplicado à Computação</p>
        </td>
        <td>
            <p><strong>Professor: </strong>Howard Roatti</p>
        </td>
        <td>
            <p><strong>Nota:</strong>_______________</p>
        </td>
    </tr>
    <tr>
        <td>
            <p><strong>Nome do Aluno: </strong></p>
        </td>
        <td>
            <p><strong>Turma: </strong></p>
        </td>
        <td>
            <p><strong>Data: </strong></p>
        </td>
    </tr>
</table>

In [1]:
import pandas as pd
import numpy as np

In [2]:
df_salarios = pd.read_csv("Salaries.csv")
df_salarios.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

<h4>1 - Quais colunas tem nesta base? Execute o comando que exibe todas as colunas</h4>

In [3]:
df_salarios.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

<strong style="color: #009e0f;">Prof. Howard: Correto!</strong>

<h4>2 - Qual é a coluna de salario base? Execute o comando que seleciona apenas essa coluna.</h4>

In [4]:
df_salarios.BasePay

0         167411.18
1         155966.02
2         212739.13
3          77916.00
4         134401.60
            ...
148649         0.00
148650          NaN
148651          NaN
148652          NaN
148653         0.00
Name: BasePay, Length: 148654, dtype: float64

<strong style="color: #009e0f;">Prof. Howard: Correto!</strong>

<h4>3 - Qual é o salário médio? Execute o comando que calula a média para cada campo de pagamento: <i>BasePay, OvertimePay, OtherPay, Benefits, TotalPay e TotalPayBenefits</i></h4>

In [5]:
df_salarios[['BasePay', 'OvertimePay', 'OtherPay', 'Benefits', 'TotalPay', 'TotalPayBenefits']].mean()

BasePay             66325.448841
OvertimePay          5066.059886
OtherPay             3648.767297
Benefits            25007.893151
TotalPay            74768.321972
TotalPayBenefits    93692.554811
dtype: float64

In [6]:
lista_colunas = ['BasePay', 'OvertimePay', 'OtherPay', 'Benefits', 'TotalPay', 'TotalPayBenefits']
for col in lista_colunas:
    print(df_salarios[col].mean())

66325.44884050643
5066.059886444622
3648.7672968046095
25007.893150830107
74768.321971703
93692.55481056834

<strong style="color: #009e0f;">Prof. Howard: Correto!</strong>

<h4>4 - Qual é o salário máximo? Execute o comando que exibe o maior salário a partir dos campos de salário: <i>BasePay, OvertimePay, OtherPay, Benefits, TotalPay e TotalPayBenefits</i>.</h4>

In [7]:
df_salarios[['BasePay', 'OvertimePay', 'OtherPay', 'Benefits', 'TotalPay', 'TotalPayBenefits']].max()

BasePay             319275.01
OvertimePay         245131.88
OtherPay            400184.25
Benefits             96570.66
TotalPay            567595.43
TotalPayBenefits    567595.43
dtype: float64

<strong style="color: #009e0f;">Prof. Howard: Correto!</strong>

<h4>5 - Qual é o emprego do JOSEPH DRISCOLL? Execute o comando que permita encontrar o emprego (JobTitle) a partir do nome JOSEPH DRISCOLL.</h4>

In [8]:
# df_salarios[df_salarios.EmployeeName == 'JOSEPH DRISCOLL']['JobTitle']

In [9]:
df_salarios.loc[df_salarios.EmployeeName == 'JOSEPH DRISCOLL', 
                'JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [10]:
# df_salarios.query("EmployeeName == 'JOSEPH DRISCOLL'").JobTitle

<strong style="color: #009e0f;">Prof. Howard: Correto!</strong>

<h4>6 - Qual o nome da pessoa que tem o maior salário de todos? Execute o(s) comando(s) que auxilie na busca para cada campo: <i>BasePay, OvertimePay, OtherPay, Benefits, TotalPay e TotalPayBenefits</i>.</h4>

In [11]:
df_salarios.loc[df_salarios.BasePay == df_salarios.BasePay.max(), "EmployeeName"]

72925    Gregory P Suhr
Name: EmployeeName, dtype: object

In [12]:
df_salarios.loc[df_salarios.OvertimePay == df_salarios.OvertimePay.max(), "EmployeeName"]

1    GARY JIMENEZ
Name: EmployeeName, dtype: object

In [13]:
df_salarios.loc[df_salarios.OtherPay == df_salarios.OtherPay.max(), "EmployeeName"]

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [14]:
df_salarios.loc[df_salarios.Benefits == df_salarios.Benefits.max(), "EmployeeName"]

110533    William J Coaker Jr.
Name: EmployeeName, dtype: object

In [15]:
df_salarios.loc[df_salarios.TotalPay == df_salarios.TotalPay.max(), "EmployeeName"]

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [16]:
df_salarios.loc[df_salarios.TotalPayBenefits == df_salarios.TotalPayBenefits.max(), "EmployeeName"]

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [17]:
for coluna in ['BasePay', 'OvertimePay', 'OtherPay', 'Benefits', 'TotalPay', 'TotalPayBenefits']:
    print(df_salarios.loc[df_salarios[coluna] == df_salarios[coluna].max(), "EmployeeName"])

72925    Gregory P Suhr
Name: EmployeeName, dtype: object
1    GARY JIMENEZ
Name: EmployeeName, dtype: object
0    NATHANIEL FORD
Name: EmployeeName, dtype: object
110533    William J Coaker Jr.
Name: EmployeeName, dtype: object
0    NATHANIEL FORD
Name: EmployeeName, dtype: object
0    NATHANIEL FORD
Name: EmployeeName, dtype: object

<strong style="color: #009e0f;">Prof. Howard: Correto!</strong>

<h4>7 - Qual é o salário médio por ano? Execute o comando necessário para o cálculo a partir do atributo: TotalPay.</h4>

In [18]:
for ano in np.unique(df_salarios.Year):
    print(ano, df_salarios.loc[df_salarios.Year == ano, "TotalPay"].mean())

2011 71744.10387123664
2012 74113.26226513737
2013 77611.44314205405
2014 75463.91814023

In [19]:
df_salarios.groupby(by=["Year"]).agg({"TotalPay": np.mean}).reset_index()

   Year      TotalPay
0  2011  71744.103871
1  2012  74113.262265
2  2013  77611.443142
3  2014  75463.918140

<strong style="color: #009e0f;">Prof. Howard: Correto!</strong>

<h4>8- Quais são os cinco empregos mais comuns (JobTitle)? Execute o comando que calcule a frequência de ocorrências(size) e ranqueie (sort_values ou sort_index) e exiba os top-5</h4>

In [20]:
df_salarios.JobTitle.value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [21]:
df_salarios.groupby(by=["JobTitle"]).agg({'Id': np.size}).rename(columns={"Id": "Qty"}).reset_index().sort_values(by="Qty", ascending=False).head()

                          JobTitle   Qty
2056              Transit Operator  7036
1902                 Special Nurse  4389
1577              Registered Nurse  3736
1544  Public Svc Aide-Public Works  2518
1482              Police Officer 3  2421

<strong style="color: #009e0f;">Prof. Howard: Correto!</strong>

<h4>9 - Como criar um outro dataframe selecionando apenas algumas colunas do dataframe original? Crie um DataFrame de exemplo denominado df_extra_salarios com as colunas: 'EmployeeName', 'JobTitle', 'TotalPay', 'Year' e 'Status'.</h4>

In [22]:
df_extra_salarios = df_salarios[['EmployeeName', 'JobTitle', 'TotalPay', 'Year', 'Status']].copy()
df_extra_salarios.head()

,EmployeeName,JobTitle,TotalPay,Year,Status
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,567595.43,2011,NaN
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),538909.28,2011,NaN
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),335279.91,2011,NaN
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,332343.61,2011,NaN
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",326373.19,2011,NaN

<strong style="color: #009e0f;">Prof. Howard: Correto!</strong>

<h4>10 - Utilizando a descrição (describe) do DataFrame, indique quais colunas deveriam ser removidas sem prejuízo de informação.</h4>

In [23]:
df_salarios.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Id,148654.0,74327.500000,42912.857795,1.00,37164.250,74327.50,111490.750,148654.00
BasePay,148045.0,66325.448841,42764.635495,-166.01,33588.200,65007.45,94691.050,319275.01
OvertimePay,148650.0,5066.059886,11454.380559,-0.01,0.000,0.00,4658.175,245131.88
OtherPay,148650.0,3648.767297,8056.601866,-7058.59,0.000,811.27,4236.065,400184.25
Benefits,112491.0,25007.893151,15402.215858,-33.89,11535.395,28628.62,35566.855,96570.66
TotalPay,148654.0,74768.321972,50517.005274,-618.13,36168.995,71426.61,105839.135,567595.43
TotalPayBenefits,148654.0,93692.554811,62793.533483,-618.13,44065.650,92404.09,132876.450,567595.43
Year,148654.0,2012.522643,1.117538,2011.00,2012.000,2013.00,2014.000,2014.00
Notes,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Status,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

<p>As colunas que podem ser removidas sem prejuízo de informações são: <strong>Notes e Status</strong></p>

<strong style="color: #009e0f;">Prof. Howard: Correto!</strong>